module.exports = {
	config: {
		name: "war2",
		version: "1.0",
		author: "Xemon",
		role: 2,
		category: "texts",
		guide: {
			vi: "Not Available",
			en: "cpx @(mention)"
		} 
	},

  onStart: async function ({ api, event, userData, args }) {
      var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("Need to tag 1 friend whome you want to scold with bad words", event.threadID);
 let name =  event.mentions[mention];
    var arraytag = []; 
        arraytag.push({id: mention, tag: name});
    var a = function (a) { api.sendMessage(a, event.threadID); }
setTimeout(() => {a({body: "welcome খানকির পোলা তোর এতিম এর মারে চুদি☺️🫶😚 " + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "চুদানি মাগির পোলা তোর মার ভুদা কালা,মানিকের বরো ধোন,চুদতে চায় তোর কচি বোন😭💋" + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "ঐ চুদানি মাগির পোলা,তোর মারে চুদতে চুদতে নিয়া জামু বইশাকির মেলা,মেলায় আইবোনাকি তোর মামু,তোর কচি বোনের ভুদাটা আমি মানিক কামরাই কামরাই খামু😋🤠❤" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "ঐ ভুদা টিমের কুত্তা বিলাই চুদানি মাগির পোলা😗ভুদা কালা ভুচকি মাগির পোলা🤪 তোর মার ভুদায় লাত্তাইয়া লাত্তাইয়া ভাংমু তোর মার সুনার নলা🤫পাইবি নাকি তুই কস্ট 🥺" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "মানিকের পোলা,চুদানি মাগির পোলা তোর মারে চুইদা চুইদা বানামু আমার জামাই মানিক এর নুনুর ভক্ত🙆‍♀️😭💋" + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "অই চুদানি মাগির পোলা🤣হেডা কালা ভুচকি মাগির পোলা📢তোর মারে চুদি সারাদিন সারা বেলা🤕😭" + " " + name, mentions: arraytag})}, 14000);
setTimeout(() => {a({body: "তোর বাবা মানিক থাকে নাকি ওমানে😱তোর মারে চুদ্মু নিয়া বিমানে✈️বিমানে আছে নাকি বড়ো বড়ো চাকা,তোর মার ভুদায় দিমু জোরে জোরে ধাক্কা🤧" + " " + name, mentions: arraytag})}, 16000);
setTimeout(() => {a({body: "অই চুদানি মাগির পোলা জেইখানে দেখবি তোর আব্বু মানিক রে সেইখানে দিবি সালাম🫡না দিলে সালাম তোর মারে চুইদা তোর মার ভুদাটা দিমু ফ্রিতে নিলাম🤠❤" + " " + name, mentions: arraytag})}, 18000);
setTimeout(() => {a({body: "ওই চুদানি মাগিরপোলা,এতিম চুদা বান্দি মাগির পোলা তোর মার ভুদায় লাগামু তালা👅💦" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "অই মাদারচোদ মাগির পোলা,তোর মারে চুদার সময় তোর মার নাভিতে লাগামু আনি গাজা😋গাজা খাইলে হয়নাকি নেশা🚭😭💋" + " " + name, mentions: arraytag})}, 22000);
setTimeout(() => {a({body: "ওই মুরগি এক্সুদানি মাগি,তোর মারে চুদতে চুদতে নিয়া জামু নানা বারি,নানা বারি আছে নাকি ছাগল,তোর মারে চুদবো রাস্তার রাম ছাগল😈💋" + " " + name, mentions: arraytag})}, 2400);
setTimeout(() => {a({body: "ওই চুদানি মাগির পোলা ছাগলের আছে নাকি পসম🤧তোর মার ভুদায় সয়তানের কছম😴চিল্লাই চিল্লাই বলবি মানিক তোর রিয়েল আব্বা" + " " + name, mentions: arraytag})}, 26000);
setTimeout(() => {a({body: "অই চুদানি মাগির পোলা,যদি জাস গ্রুপ থাইকা ভাইগা 😑তোর মারে চুদ্মু রাস্তায় হাইটা হাইটা📢👅💦" + " " + name, mentions: arraytag})}, 28000);
setTimeout(() => {a({body: "কিরে মাগির পোলা চুদা খেয়ে মরে গেলি নাকি🚑😭💋" + " " + name, mentions: arraytag})}, 30000);
setTimeout(() => {a({body: "অই মরা মুরগি চুদানি মাগির পোলা তোর মার ভুদায় জুতার বারি👣🦵 " + " " + name, mentions: arraytag})}, 32000);
setTimeout(() => {a({body: "ওই খানকি মাগির পোলা তোর এতিম এর মারে চুদি,মানিক রে বাপ ডাক 😭💋" + " " + name, mentions: arraytag})}, 65000);
setTimeout(() => {a({body: "চুদানি মাগির পোলা তোর মার ভুদা কালা,মানিকের বরো ধোন,চুদতে চায় তোর কচি বোন😭💋 " + " " + name, mentions: arraytag})}, 34000);
setTimeout(() => {a({body: "ওই চুদানি মাগির পোলা ছাগলের আছে নাকি পসম🤧তোর মার ভুদায় সয়তানের কছম😴চিল্লাই চিল্লাই বলবি মানিক তোর রিয়েল আব্বা🤠❤" + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a({body: "ঐ চুদানি মাগির পোলা,তোর মারে চুদতে চুদতে নিয়া জামু বইশাকির মেলা,মেলায় আইবোনাকি তোর মামু,তোর কচি বোনের ভুদাটা আমি মানিক কামরাই কামরাই খামু" + " " + name, mentions: arraytag})}, 38000);
setTimeout(() => {a({body: "ওই চুত্মারানি মাগির পোলা,আলু পোটল তরকারি, তোর আতিম এর মার ভুদাটা নিলাম দিমু সরকারি🤠❤" + " " + name, mentions: arraytag})}, 40000);
setTimeout(() => {a({body: "ওই চুদানি মাগিরপোলা,এতিম চুদা বান্দি মাগির পোলা তোর মার ভুদায় লাগামু তালা👅🤠❤" + " " + name, mentions: arraytag})}, 44000);
setTimeout(() => {a({body: "কিরে মাগির পোলা চুদা খেয়ে মরে গেলি নাকি🚑😭💋 " + " " + name, mentions: arraytag})}, 460000);
setTimeout(() => {a({body: "ওই খানকি মাগির পোলা তোর এতিম এর মারে চুদি,মানিক রে বাপ ডাক 😭💋🤠🫀" + " " + name, mentions: arraytag})}, 48000);
setTimeout(() => {a({body: "চুদানি মাগির পোলা তোর মার ভুদা কালা,মানিকের বরো ধোন,চুদতে চায় তোর কচি বোন😭💋" + " " + name, mentions: arraytag})} , 50000);
setTimeout(() => {a({body: "মানিকের পোলা,চুদানি মাগির পোলা তোর মারে চুইদা চুইদা বানামু আমার জামাই মানিক এর নুনুর ভক্ত🙆‍♀️" + " " + name, mentions: arraytag})} , 52000);
setTimeout(() => {a({body: "অই চুদানি মাগির পোলা🤣হেডা কালা ভুচকি মাগির পোলা📢তোর মারে চুদি সারাদিন সারা বেলা🤕😭" + " " + name, mentions: arraytag})} , 56000);
setTimeout(() => {a({body: "THOPPDAA PDDIIT SLALA  XORORO TEORO THOPPDA HERDAA MEROO UTHEEKO LADOO NI SUTXA🙀❤" + " " + name, mentions: arraytag})} , 58000);
setTimeout(() => {a({body: "TWROO AMAA NAII HO MEROO TURUU AND PURE LOVE KANNXXOO😘😘" + " " + name, mentions: arraytag})} , 60000);
setTimeout(() => {a({body: "ওই খানকি মাগির পোলা তোর এতিম এর মারে চুদি,মানিক রে বাপ ডাক 💋😻" + " " + name, mentions: arraytag})} , 62000);
setTimeout(() => {a({body: "TEOROO AAMA NEPAALL TOP RANNDI HAINAA UNIVERSALL TOP RANDI KO KANXXOO🤠❤"+ " " + name, mentions: arraytag})} , 64000);
setTimeout(() => {a({body: "TEROOO BAAINI RW TEORO AMAA LAAII MERAII SINGLE BED MA DUITAI LAII EUTAI THAU MA SUTAI SANGAII CHIKXU 🤠❤" + " " + name, mentions: arraytag})} , 66000);
setTimeout(() => {a({body: "ঐ চুদানি মাগির পোলা,তোর মারে চুদতে চুদতে নিয়া জামু বইশাকির মেলা,মেলায় আইবোনাকি তোর মামু,তোর কচি বোনের ভুদাটা আমি মানিক কামরাই কামরাই খামু"🤠❤" + " " + name, mentions: arraytag})} , 68000);
setTimeout(() => {a({body: "RANNDI KO BACHAHHA SLALAA AMA KO KALO CHAURII PAREKO PUTII JASTAI THOPDA BOKER BAU KO AGHADI AUUXAS🤣🤣🤣" + " " + name, mentions: arraytag})} , 70000);
setTimeout(() => {a({body: "TROOO AMA LIAI CHIKER MAILE DEKO PAAISA LE TEROO GHAR CHHALXA XOROO SLA VIKARIIII🤠❤" + " " + name, mentions: arraytag})} , 72000);
setTimeout(() => {a({body: "TEOROO AMA KO KAANNDDOO MADALL JHAAII BAJAAMM BHAANNT SLA XORO🤠♥" + " " + name, mentions: arraytag})} , 74000);
setTimeout(() => {a({body: "মানিকের পোলা,চুদানি মাগির পোলা তোর মারে চুইদা চুইদা বানামু আমার জামাই মানিক এর নুনুর ভক্ত🤠❤" + " " + name, mentions: arraytag})} , 76000);
setTimeout(() => {a({body: "TEROOO AMA KO SABLEE PUTII CHIKER DULO NI YETROO BHAXA SLAAA TEORO PURA KHAANNDAN KOCHAREY NI AJHA DHERAI THAU BAKI RAHAANNXA🤠❤" + " " + name, mentions: arraytag})} , 78000);
setTimeout(() => {a({body: "অই মরা মুরগি চুদানি মাগির পোলা তোর মার ভুদায় জুতার বারি👣🦵❤" + " " + name, mentions: arraytag})} , 80000);
setTimeout(() => {a({body: "PAILAA LEVEL MILA ANII AAIJAA JATHOO MADARCHOOD" + " " + name, mentions: arraytag})} , 82000);
setTimeout(() => {a({body: "LWW MACHIKNEYY RANDIKOO NASOO MA GAYE ABA TA JATHOO SAKDAINAS MA SANGAA FYTT HANNA" + " " + name, mentions: arraytag})} , 84000);
setTimeout(() => {a({body: "তোর মারে চুদা শেষ জাইগা!!😾🥀🤣" + " " + name, mentions: arraytag})} , 84000);
  }
};
