module.exports = {
	config: {
		name: "war2",
		version: "1.0",
		author: "manik",
		role: 2,
		category: "texts",
		guide: {
			vi: "Not Available",
			en: "cpx @(mention)"
		} 
	},

  onStart: async function ({ api, event, userData, args }) {
      var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("মানিক ভাই খানকি মাগিরে একটা মেনশন দেন-!!🫂", event.threadID);
 let name =  event.mentions[mention];
    var arraytag = []; 
        arraytag.push({id: mention, tag: name});
    var a = function (a) { api.sendMessage(a, event.threadID); }
setTimeout(() => {a({body: "চুদা লো খানকি মাগি😴📣 " + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "তোর বেগুন মারা মাগির মারে চুদি খানকি মাগি💋" + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "ভারচুয়ালের ভুদা কালা মাগি মানিকের সাথে হাতমার তোরে টাকা দিমু🤠❤" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "তোর হাতমারা মাগির মারে চুদি বান্দি মাগি😴মানিকের নুনুটা চুষেদে😋" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "অই চুদানি মাগি চুইদা চুইদা ভাংমু তোর মার ভুদার টাইংকি💋" + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "সুনলাম তুই নাকি ভারচুয়ালের টপ হাতমারা মাগি তোর মারে চুইদা চুইদা বানামু অনলাইনে গাধি☺️" + " " + name, mentions: arraytag})}, 14000);
setTimeout(() => {a({body: "তুই নাকি অনলাইনের হাতমারা মাল🤨তোর মারে চুইদা তোর মার ভুদাটা বানামু খাল🫠খালে ছারমু মাছ🫡তোর মারে চুদবো মানিক সব্দ হইবো টপাস টপাস🤣📣" + " " + name, mentions: arraytag})}, 16000);
setTimeout(() => {a({body: "মানিক নাকি ভারচুয়াল জগতের রাজা😚তোর মার নাভিতে জালায়া খামু আমি গাজা😋গাজা খাইলে হয়নাকি নেশা😵‍💫" + " " + name, mentions: arraytag})}, 18000);
setTimeout(() => {a({body: "তোর মতো পতিতা মাগিরে চুদাই আমার পেশা🤫" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "অই চুদানি মাগি,কথা কবি কম কম তোর মার ভুদায় লাগামু আমি আইটেম বম,বম জাইবোনাকি ফাইটা💣তোর মারে চুদমু হাইটা হাইটা🚶‍♂️🚶‍♂️🚶‍♂️" + " " + name, mentions: arraytag})}, 22000);
setTimeout(() => {a({body: "অই চুদানি মাগি,আমি গালি পারিনা গালি গেছি ভুইলা🤦‍♂️তোর মারে চুদি জামা কাপোর খুইলা💋" + " " + name, mentions: arraytag})}, 2400);
setTimeout(() => {a({body: "তুইনাকি অনলাইন জগতের পতিতা,তোর মারে চুইদা তোর মার ভুদায় দিমু আমি মুইতা😝" + " " + name, mentions: arraytag})}, 26000);
setTimeout(() => {a({body: "মানিক তোর রিয়েল বাপ লাগে চুদানি মাগি🙃" + " " + name, mentions: arraytag})}, 28000);
setTimeout(() => {a({body: "মানিক রে ভিডিও কল দিয়া হাতমার মাগি তোরে সাপরট দিমু 🤭" + " " + name, mentions: arraytag})}, 30000);
setTimeout(() => {a({body: "অই বস্তির মাগি 1টাকার কালা ভুদা নিয়া নিজেরে fmz দাবি করস🤔তোর পতিতার মারে চুদি😚☺️" + " " + name, mentions: arraytag})}, 32000);
setTimeout(() => {a({body: "হিজলা মাগির মেয়ে বালি দিয়া চুদমু তরে খাঙ্কি মাগী!তর মাকে।  ✋" + " " + name, mentions: arraytag})}, 65000);
setTimeout(() => {a({body: "টুকাই মাগির মেয়ে তর মার ভোদায় পাব্লিক টয়লেট।🤟" + " " + name, mentions: arraytag})}, 34000);
setTimeout(() => {a({body: "জং ধরা লোহা দিয়া পাকিস্তানের মানচিত্র বানাই্য়া তোদের পিছন দিয়া ঢুকামু।🤬" + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a({body: "খান্কি মাগির মেয়ে তর মায়ের ভোদা শিরিষ কাগজ দিয়া ঘইষা দিমু।" + " " + name, mentions: arraytag})}, 38000);
setTimeout(() => {a({body: "খাঙ্কিরমেয়ে মেয়ে তর বোনের  হোগায় ইনপুট, তর মায়ের ভোদায় আউটপুট।🐰" + " " + name, mentions: arraytag})}, 40000);
setTimeout(() => {a({body: "টুকাই মাগির মেয়ে মোবাইল ভাইব্রেশন কইরা তুর কচি বোন এর পুকটিতে ভরবো।🤟" + " " + name, mentions: arraytag})}, 44000);
setTimeout(() => {a({body: "ব্যাস্যার মেয়ে কথা শুন তর আম্মু রে চুদি গামছা পেচিয়ে🐰 " + " " + name, mentions: arraytag})}, 460000);
setTimeout(() => {a({body: "DNA টেষ্ট করা দেখবি আমার চুদা তেই তর জন্ম।" + " " + name, mentions: arraytag})}, 48000);
setTimeout(() => {a({body: "হাই মাদারচোদ তর তর ব্যাশা জাতের আম্মু টা রে আদর করে করে চুদি" + " " + name, mentions: arraytag})} , 50000);
setTimeout(() => {a({body: "বাতিজা শুন তর আম্মু রে চুদলে রাগ করবি না তো আচ্ছা জা রাগ করিস না তর আম্মুর কালা ভুদায় আর চুদলাম না তো বোন এর জামা টা খুলে দে  ✋" + " " + name, mentions: arraytag})} , 52000);
setTimeout(() => {a({body: "অনলাইনে গালি বাজ হয়ে গেছত মাগির মেয়ে এমন চুদা দিমু লাইফ টাইম মনে রাখভি  নয়ন তর বাপ মাগির মেয়ে 😘।" + " " + name, mentions: arraytag})} , 56000);
setTimeout(() => {a({body: "বান্দি মাগির মেয়ে তর আম্মু রে চুদি তর দুলা ভাই এর কান্দে ফেলে  🤝" + " " + name, mentions: arraytag})} , 58000);
setTimeout(() => {a({body: "খাংকি মাগির মেয়ে কথা ক কম কম তর আম্মু রে চুদে বানামু আইটেম বোম" + " " + name, mentions: arraytag})} , 60000);
setTimeout(() => {a({body: "খাংকির মেয়ে তর কচি বোন রে চুদি 😍" + " " + name, mentions: arraytag})} , 62000);
setTimeout(() => {a({body: "খাংকির মেয়ে তর কচি ভুদায় ভুদায় কামর দিমু  💔"+ " " + name, mentions: arraytag})} , 64000);
setTimeout(() => {a({body: "তর আম্মু রে আচার এর লোভ দেখি চুদি মাগির মেয়ে🤬" + " " + name, mentions: arraytag})} , 66000);
setTimeout(() => {a({body: "depression থেকেও তর মাইরে চু*** দি 🤬" + " " + name, mentions: arraytag})} , 68000);
setTimeout(() => {a({body: "খাঙ্কিরমেয়ে মেয়ে কথা শুন তর আম্মু রে চুদি গামছা পেচিয়ে🐰" + " " + name, mentions: arraytag})} , 70000);
setTimeout(() => {a({body: "হিজলা মাগির মেয়ে হাতির ল্যাওড়া দিয়া তর মায়েরে চুদুম।  ✋" + " " + name, mentions: arraytag})} , 72000);
setTimeout(() => {a({body: "কুত্তার বাচ্ছা তর বৌন ভোদায় মাগুর মাছ চাষ করুম।😍" + " " + name, mentions: arraytag})} , 74000);
setTimeout(() => {a({body: "কান্দে ফালাইয়া তর মায়েরে চুদি💉।" + " " + name, mentions: arraytag})} , 76000);
setTimeout(() => {a({body: "তোর মুখে হাইগ্যা দিমু। ভুস্কি মাগির মেয়ে 🤣" + " " + name, mentions: arraytag})} , 78000);
setTimeout(() => {a({body: "তর মায়ের ভোদা বোম্বাই মরিচ দিয়া চুদামু।💔" + " " + name, mentions: arraytag})} , 80000);
setTimeout(() => {a({body: "বস্তির মেয়ে তোর বইনরে মুসলমানি দিমু।" + " " + name, mentions: arraytag})} , 82000);
setTimeout(() => {a({body: "তর বোন রে পায়জামা খুলে চুদি 🤣" + " " + name, mentions: arraytag})} , 84000);
setTimeout(() => {a({body: "আমার মেয়ে। জা ভাগ😝📢🦵" + " " + name, mentions: arraytag})} , 84000);
  }
};
